In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"E:\Uddanous\10 Feb\Bank+Churn+Data.csv")

In [3]:
df.head()

,CustomerID,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Churn
0,1,Davis,764,Germany,Male,20,7,119274.87,3,1,0,107886.77,0
1,2,Smith,365,Spain,Female,64,3,203737.4,3,1,1,52848.11,0
2,3,Jones,519,Germany,Male,69,6,146780.5,3,0,0,94395.02,0
3,4,Jones,516,Germany,Female,59,0,23572.03,1,1,0,146739.55,0
4,5,Wilson,659,Spain,Female,21,2,7463.43,1,1,1,16036.55,0

In [4]:
df.isnull().sum()

CustomerID         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    3
Churn              0
dtype: int64

In [5]:
df['Balance'].describe()

count           500
unique          500
top       119274.87
freq              1
Name: Balance, dtype: object

In [6]:
df['EstimatedSalary'].fillna(df['EstimatedSalary'].mean(), inplace=True)

In [8]:
df['Balance'] = pd.to_numeric(df['Balance'], errors='coerce')

In [9]:
df[df['Balance'].isnull()]

,CustomerID,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Churn
68,69,Wilson,450,Spain,Male,80,4,NaN,2,0,0,10848.47,0

In [10]:
df['Balance'].fillna(df['Balance'].mean(), inplace=True)

In [11]:
print(df['Balance'].dtype)

float64

In [12]:
df.isnull().sum()

CustomerID         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Churn              0
dtype: int64

In [15]:
df.to_csv("Cleaned_Bank+Churn+Data.csv", index=False)